1 'PROGRAM メインプログラム
2 '*******************************************************************************************
3 '用途：
4 '作成日：
5 '会社名：
6 '*******************************************************************************************
7 '
8 'M_Outb(6072)= 0'　　使用信号リセット
9 Tool 1
10 Dim J_taiki(3)
11 Dim P_handa(3)
12 Dim Pset_apro(3)
13 Dim Ppick_af(3)
14 Ppick_af(1) = P_pick+(+0.00,+0.00,+25.00)
15 Ppick_af(2) = P_pick+(+0.00,-15.00,+25.00)
16 Ppick_af(3) = P_pick+(+0.00,-15.00,+150.00)
17 Tool 2
18 Pset_apro(1) = P_set+(-50.00,+0.00,+160.00)
19 Pset_apro(2) = P_set+(+10.00,+0.00,+70.00)
20 Pset_apro(3) = P_set+(+10.00,+0.00,+0.00)
21 '
22 Msp_hanso = 10'     搬送速度
23 Mhanda_time = 2'        ハンダ付け時間
24 '
25 Phere = P_Curr
26 Pgen = JtoP(J_HOME)
27 '
28 Mdist = Dist(Phere,Pgen)
29 If Mdist>150 Then
30     Hlt'    原点以外からの起動
31 EndIf
32 '
33 Cnt 1
34 Fine 1,J
35 Mov J_HOME
36 Dly 0.5
37 '
38 Fine 0,P
39 Fine 0,J
40 '
41 *PLOOP
42 Tool 1'         はんだツール
43 Ovrd 40
44 Spd 1000
45 Wait M_In(6094)=1
46 If (M_In(6095)=1) Then
47 GoTo *finish
48 EndIf
49 Wait M_In(6072)=1'      ハンダ可能
50 Mov J_taiki(1)'     ハンダ待機位置
51 '
52 Cnt 0
53 Fine 1,P
54 Mvs P_handa(1),-50
55 For M1 = 1 To 3'　　ハンダﾎﾟｼﾞｼｮﾝ３回繰り返し
56     Spd 500
57     Mvs P_handa(M1),-10
58     Spd 250
59     Mvs P_handa(M1)
60     Dly Mhanda_time
61     Mvs P_handa(M1),-10
62 Next M1
63 Mvs P_handa(3),-50
64 '
65 Cnt 1
66 Fine 0,P
67 Fine 0,J
68 Ovrd 40
69 Spd 1500
70 '
71 Mvs J_taiki(1)
72 Dly 0.1
73 M_Out(6072)=1 '        ハンダ完了　X1728
74 Wait M_In(6073)=1'      ワーク取出し可 Y1729
75 Tool 2'     吸着ツール
76 Mvs J_taiki(2)'     ワーク取出し待機位置
77 '
78 Cnt 0
79 Fine 1,P
80 Mvs P_pick,-100
81 Spd 500
82 Mvs P_pick
83 Dly 0.1
84 M_Out(6078)=1'      吸着ON　X172E
85 Dly 0.5
86 Spd 350
87 Mvs Ppick_af(1)
88 Mvs Ppick_af(2)
89 Mvs Ppick_af(3)
90 Ovrd 30
91 '
92 Cnt 1
93 Fine 0,P
94 Fine 0,J
95 '
96 Spd 700
97 Mvs J_taiki(2)
98 M_Out(6075) = 1'ワーク持ち上げ位置到着完了　Ｘ１７２Ｂ
99 Wait M_In(6075) = 1'次工程移行準備完了 Y172B
100 Mov J_taiki(3)
101 Fine 20,P
102 Spd 600
103 Mvs Pset_apro(1)
104 Mvs Pset_apro(2)
105 '
106 Cnt 0
107 Fine 1,P
108 Fine 1,J
109 Mvs Pset_apro(3)
110 '
111 Spd 250
112 Mvs P_set
113 Dly 0.1
114 M_Out(6078)=0'      吸着OFF　X172E
115 Dly 0.5
116 Spd 450
117 Mvs P_set,-30
118 Spd 500
119 Mvs P_set,-100
120 '
121 Cnt 1
122 Fine 0,P
123 Fine 0,J
124 Spd 1500
125 Ovrd 40
126 Mvs J_taiki(3)
127 '
128 Fine 1,J
129 Mov J_HOME
130 Dly 0.1
131 M_Out(6076) = 1 '半田付け後セット完了信号　 x172C
132 Dly 3
133 If M_In(6077)=1 Then
134     Hlt'        サイクル停止
135 EndIf
136 'Mov J_taiki(1)
137 'GoTo *PLOOP
138 *finish
139 Wait M_In(6079) = 1'全体運転完了完了信号　 Y172F
140 '
141 Clr 0
142 End
P_handa(1)=(+710.15,-129.03,+401.38,+179.83,-0.02,-168.19,+0.00,+0.00)(7,0)
P_handa(2)=(+710.15,-124.90,+401.38,+179.83,-0.02,-168.19,+0.00,+0.00)(7,0)
P_handa(3)=(+710.15,-120.48,+401.38,+179.83,-0.02,-168.19,+0.00,+0.00)(7,0)
Pset_apro(1)=(+729.14,+183.37,+554.71,+179.82,-4.54,-179.92,+0.00,+0.00)(7,0)
Pset_apro(2)=(+789.14,+183.37,+464.71,+179.82,-4.54,-179.92,+0.00,+0.00)(7,0)
Pset_apro(3)=(+789.14,+183.37,+394.71,+179.82,-4.54,-179.92,+0.00,+0.00)(7,0)
Ppick_af(1)=(+783.27,-128.28,+419.64,+179.70,-1.42,-177.59,+0.00,+0.00)(7,0)
Ppick_af(2)=(+783.27,-143.28,+419.64,+179.70,-1.42,-177.59,+0.00,+0.00)(7,0)
Ppick_af(3)=(+783.27,-143.28,+544.64,+179.70,-1.42,-177.59,+0.00,+0.00)(7,0)
P_pick=(+783.27,-128.28,+394.64,+179.70,-1.42,-177.59,+0.00,+0.00)(7,0)
P_set=(+779.14,+183.37,+394.71,+179.82,-4.54,-179.92,+0.00,+0.00)(7,0)
Phere=(+257.73,+13.02,+611.54,+179.75,-45.01,-174.15)(7,0)
Pgen=(+257.73,+13.02,+611.54,+179.75,-45.01,-174.15,+0.00,+0.00)(7,0)
J_taiki(1)=(-15.33,-7.27,+81.51,+0.15,+105.86,-27.10,+0.00,+0.00)
J_taiki(2)=(-19.51,-26.65,+104.25,+14.11,+64.36,-21.24,+0.00,+0.00)
J_taiki(3)=(+9.56,-29.41,+105.98,-6.71,+63.50,+10.37,+0.00,+0.00)
J_HOME=(+3.04,-43.02,+104.62,+0.20,+118.42,-2.54)
